{
  "navigation": {
    "home": "Home",
    "deathwatch": "DeathWatch",
    "pathfinder": "Pathfinder",
    "dnd5e": "D&D 5e",
    "cyberpunkRed": "Cyberpunk RED",
    "vampireV5": "Vampire V5",
    "rpgCommunity": "RPG Community"
  },
  "common": {
    "loading": "Loading...",
    "learnMore": "Learn More →",
    "backToHome": "← Back to Home",
    "previous": "← Previous",
    "next": "Next →",
    "coreTitle": "Core Mechanics",
    "characterTitle": "Character Creation",
    "combatTitle": "Combat Fundamentals",
    "triviaTitle": "Trivia",
    "historyTitle": "History"
  },
  "home": {
    "heroTitle": "🎲 RPG Community",
    "heroSubtitle": "Explore the Realms of Imagination",
    "welcomeTitle": "Welcome to the Ultimate RPG Hub",
    "welcomeDescription": "Dive into the rich worlds of tabletop role-playing games. Whether you're a seasoned adventurer or just beginning your journey, our community guides will help you master the art of storytelling and strategic gameplay.",
    "exploreTitle": "Explore Game Systems",
    "loadingText": "Loading RPG systems...",
    "featuresTitle": "What You'll Find Here",
    "coreMechanics": "Core Mechanics",
    "coreMechanicsDesc": "Master dice systems and basic gameplay rules",
    "characterCreation": "Character Creation",
    "characterCreationDesc": "Build heroes that will live forever in legend",
    "combatSystems": "Combat Systems",
    "combatSystemsDesc": "Navigate tactical battles and epic confrontations",
    "keyConcepts": "Key Concepts",
    "keyConceptsDesc": "Understand the unique elements of each system"
  },
  "deathwatch": {
    "title": "⚔️ DEATHWATCH",
    "subtitle": "In the grim darkness of the far future, there is only war",
    "coreSystem": {
      "title": "🎲 Core Mechanics",
      "diceSystem": "Dice System",
      "primary": "Primary: d100 (percentile) system",
      "success": "Success: Roll under your target number",
      "degrees": "Degrees of Success: Every 10 points under = 1 degree",
      "critSuccess": "Critical Success: Rolling 01-05",
      "critFailure": "Critical Failure: Rolling 96-00",
      "keyConcepts": "Key Concepts",
      "spaceMarines": "Space Marines: Genetically enhanced super-soldiers",
      "deathwatchDesc": "Deathwatch: Elite xenos-hunting chapter",
      "killTeams": "Kill-Teams: Small squads of specialists",
      "requisition": "Requisition: Equipment acquisition system",
      "renown": "Renown: Reputation and honor system"
    },
    "character": {
      "title": "👤 Character Creation",
      "characteristics": "Primary Characteristics",
      "ws": "Weapon Skill (WS): Melee combat",
      "bs": "Ballistic Skill (BS): Ranged combat",
      "strength": "Strength (S): Physical power",
      "toughness": "Toughness (T): Endurance",
      "agility": "Agility (Ag): Speed and dexterity",
      "intelligence": "Intelligence (Int): Mental acuity",
      "perception": "Perception (Per): Awareness",
      "willpower": "Willpower (WP): Mental fortitude",
      "fellowship": "Fellowship (Fel): Social skills",
      "chapterSelection": "Chapter Selection",
      "ultramarines": "Ultramarines: Tactical flexibility",
      "imperialFists": "Imperial Fists: Defensive specialists",
      "bloodAngels": "Blood Angels: Assault experts",
      "spaceWolves": "Space Wolves: Savage warriors",
      "darkAngels": "Dark Angels: Secretive veterans"
    },
    "combat": {
      "title": "⚔️ Combat Fundamentals",
      "combatFlow": "Combat Flow",
      "initiative": "Initiative: Roll d10 + Agility Bonus",
      "actions": "Actions: Half/Full actions per turn",
      "attackRoll": "Attack Roll: d100 vs. appropriate skill",
      "damage": "Damage: Weapon damage + degrees of success",
      "armor": "Armor: Reduces damage taken",
      "specialRules": "Special Rules",
      "righteousFury": "Righteous Fury: Critical hits can chain",
      "fatePoints": "Fate Points: Reroll dice or avoid death",
      "squadMode": "Squad Mode: Team-based special abilities",
      "hordeRules": "Horde Rules: Fighting large groups of enemies"
    },
    "trivia": {
      "title": "🌟 Trivia",
      "fact1": "Deathwatch Space Marines are selected from different Chapters and specially trained to combat xenos threats.",
      "fact2": "A typical Deathwatch service stint lasts decades, and many Marines never return to their original Chapter.",
      "fact3": "The silver arm of the Deathwatch indicates the bearer has fought against thousands of xenos species.",
      "fact4": "Kill-Team members often come from different Chapters, creating a fusion of varied tactics and traditions."
    },
    "history": {
      "title": "📚 History",
      "origins": "Origins: The Deathwatch was founded during Waaagh! Kartöz in M32. It serves as the armed wing of the Ordo Xenos.",
      "purpose": "Purpose: Comprises specially trained and equipped Space Marines to protect the Imperium from xenos threats.",
      "structure": "Structure: Organized in Watch Fortresses across the galaxy, the Deathwatch maintains constant vigilance against xenos threats.",
      "legacy": "Legacy: Throughout 40,000 years, the Deathwatch has eliminated countless xenos species and secured the galaxy for Humanity."
    }
  },
  "pathfinder": {
    "title": "🗡️ PATHFINDER",
    "subtitle": "Epic Fantasy Adventures with Limitless Possibilities",
    "coreSystem": {
      "title": "🎲 Core Mechanics",
      "diceSystem": "Dice System",
      "primary": "Primary: d20 system",
      "roll": "Roll: d20 + modifiers vs. target number",
      "critSuccess": "Critical Success: Natural 20",
      "critFailure": "Critical Failure: Natural 1",
      "skillChecks": "Skill Checks: d20 + skill rank + ability modifier",
      "keyConcepts": "Key Concepts",
      "bab": "Base Attack Bonus (BAB): Combat proficiency",
      "savingThrows": "Saving Throws: Fortitude, Reflex, Will",
      "ac": "Armor Class (AC): Defense rating",
      "hitPoints": "Hit Points: Health and vitality",
      "feats": "Feats: Special abilities and bonuses"
    },
    "character": {
      "title": "👤 Character Creation",
      "abilityScores": "Ability Scores",
      "strength": "Strength (Str): Physical power",
      "dexterity": "Dexterity (Dex): Agility and reflexes",
      "constitution": "Constitution (Con): Health and stamina",
      "intelligence": "Intelligence (Int): Reasoning ability",
      "wisdom": "Wisdom (Wis): Awareness and insight",
      "charisma": "Charisma (Cha): Force of personality",
      "coreClasses": "Core Classes",
      "fighter": "Fighter: Master of weapons and armor - A disciplined warrior trained in a variety of combat techniques. Fighters excel at martial combat, using their extensive training and combat experience to overcome any foe. They can specialize in different fighting styles, from sword and shield to archery or two-weapon fighting.",
      "wizard": "Wizard: Arcane spellcaster - A scholarly magic-user capable of manipulating the structures of reality. Wizards learn their magic through years of study and research, recording their spells in spellbooks. They can cast the most powerful spells but require time to prepare them each day.",
      "cleric": "Cleric: Divine magic and healing - A priestly champion who wields divine magic in service of a higher power. Clerics are intermediaries between the mortal world and the distant planes of the gods. They can heal wounds, create miracles, and even raise the dead.",
      "rogue": "Rogue: Stealth and skill specialist - A scoundrel who uses stealth, trickery, and their wits to overcome obstacles. Rogues excel at finding and disarming traps, picking locks, and gathering information. In combat, they rely on precision strikes and surprise attacks.",
      "ranger": "Ranger: Nature warrior and tracker - A warrior of the wilderness who uses martial prowess, nature magic, and martial skill to combat threats on the edges of civilization. Rangers are skilled hunters and trackers, able to navigate difficult terrain and survive in the wild.",
      "barbarian": "Barbarian: Savage warrior - A fierce warrior of primitive background who can enter a battle rage. Barbarians are known for their incredible strength and durability, charging into battle with reckless abandon. Their rage makes them nearly unstoppable in combat.",
      "bard": "Bard: Jack-of-all-trades performer - An inspiring magician whose power echoes the music of creation. Bards use their artistic talents to induce magical effects and inspire allies. They are skilled performers, diplomats, and adventurers who can adapt to any situation.",
      "sorcerer": "Sorcerer: Innate magical power - A spellcaster who draws on inherent magic from a gift or bloodline. Sorcerers don't study magic like wizards; instead, they are born with magical abilities. Their magic is more flexible and spontaneous than other spellcasters.",
      "monk": "Monk: Martial arts master - A master of martial arts, harnessing the power of the body in pursuit of physical and spiritual perfection. Monks train their bodies to be weapons, using unarmed strikes and martial arts techniques. They can move with incredible speed and agility.",
      "paladin": "Paladin: Holy warrior - A holy warrior bound to a sacred oath. Paladins are champions of good and order, combining martial prowess with divine magic. They are bound by strict codes of conduct and can smite evil with divine power.",
      "druid": "Druid: Nature's guardian - A priest of the Old Faith, wielding the powers of nature and adopting animal forms. Druids are guardians of the natural world, able to communicate with animals and manipulate the forces of nature. They can transform into animals and cast nature-based spells."
    },
    "combat": {
      "title": "⚔️ Combat Fundamentals",
      "combatRound": "Combat Round",
      "initiative": "Initiative: d20 + Dex modifier",
      "actions": "Actions: Move, Standard, Swift, Free",
      "attackRoll": "Attack Roll: d20 + BAB + ability modifier",
      "damage": "Damage: Weapon die + ability modifier",
      "acCheck": "AC Check: Beat target's Armor Class",
      "specialCombat": "Special Combat",
      "flanking": "Flanking: +2 attack bonus from positioning",
      "opportunity": "Attacks of Opportunity: Free attacks on movement",
      "criticalHits": "Critical Hits: Confirm with second roll",
      "spellcasting": "Spellcasting: Provokes opportunity attacks"
    },
    "trivia": {
      "title": "🌟 Trivia",
      "fact1": "Pathfinder was designed as the 'spiritual successor' to D&D 3.5 rules and uses the OGL (Open Gaming License).",
      "fact2": "The world of Golarion is a diverse planet where each nation is inspired by different real-world cultures.",
      "fact3": "Pathfinder has over 40 base classes, each customizable with unique archetypes.",
      "fact4": "The game's prestige classes allow characters to specialize in very specific roles."
    },
    "history": {
      "title": "📚 History",
      "origins": "Origins: Pathfinder was created by Paizo Publishing in 2009 as an alternative to Dungeons & Dragons 4th Edition.",
      "development": "Development: Also known as 'D&D 3.75', the system is an improved version of the 3.5 edition.",
      "success": "Success: Between 2011-2014, it became the world's best-selling RPG and earned the nickname 'D&D killer'.",
      "legacy": "Legacy: Pathfinder has earned an important place in the RPG world with complex character customization and rich storytelling."
    }
  },
  "dnd5e": {
    "title": "🐉 D&D 5TH EDITION",
    "subtitle": "The World's Greatest Roleplaying Game",
    "coreSystem": {
      "title": "🎲 Core Mechanics",
      "diceSystem": "Dice System",
      "primary": "Primary: d20 system",
      "advantage": "Advantage: Roll twice, take higher",
      "disadvantage": "Disadvantage: Roll twice, take lower",
      "proficiency": "Proficiency Bonus: +2 to +6 based on level",
      "difficulty": "Difficulty Classes: 5 (very easy) to 30 (nearly impossible)",
      "keyConcepts": "Key Concepts",
      "abilityChecks": "Ability Checks: d20 + ability modifier + proficiency",
      "savingThrows": "Saving Throws: Resist harmful effects",
      "skills": "Skills: Specialized applications of abilities",
      "inspiration": "Inspiration: Reward for great roleplay",
      "rests": "Short/Long Rests: Recovery mechanisms"
    },
    "character": {
      "title": "👤 Character Creation",
      "abilityScores": "Ability Scores",
      "strength": "Strength: Physical power",
      "dexterity": "Dexterity: Agility and reflexes",
      "constitution": "Constitution: Health and stamina",
      "intelligence": "Intelligence: Reasoning ability",
      "wisdom": "Wisdom: Perception and insight",
      "charisma": "Charisma: Force of personality",
      "coreClasses": "Core Classes",
      "barbarian": "Barbarian: Fierce warrior of primitive background - A fierce warrior of primitive background who can enter a battle rage. Barbarians are known for their incredible strength and durability, charging into battle with reckless abandon. Their rage makes them nearly unstoppable in combat, and they can shrug off damage that would kill lesser warriors.",
      "bard": "Bard: Inspiring magician whose power echoes music - An inspiring magician whose power echoes the music of creation. Bards use their artistic talents to induce magical effects and inspire allies. They are skilled performers, diplomats, and adventurers who can adapt to any situation. Their magic comes from their artistic expression and ability to inspire emotion.",
      "cleric": "Cleric: Priestly champion who wields divine magic - A priestly champion who wields divine magic in service of a higher power. Clerics are intermediaries between the mortal world and the distant planes of the gods. They can heal wounds, create miracles, and even raise the dead. Their power comes from their faith and devotion to their deity.",
      "druid": "Druid: Priest of nature, wielding elemental forces - A priest of the Old Faith, wielding the powers of nature and adopting animal forms. Druids are guardians of the natural world, able to communicate with animals and manipulate the forces of nature. They can transform into animals and cast nature-based spells, drawing power from the natural world itself.",
      "fighter": "Fighter: Master of martial combat - A master of martial combat, skilled with a variety of weapons and armor. Fighters learn and perfect combat techniques that allow them to excel in battle. They can specialize in different fighting styles, from sword and shield to archery or two-weapon fighting, and are known for their reliability and versatility.",
      "monk": "Monk: Master of martial arts, harnessing inner power - A master of martial arts, harnessing the power of the body in pursuit of physical and spiritual perfection. Monks train their bodies to be weapons, using unarmed strikes and martial arts techniques. They can move with incredible speed and agility, and their ki allows them to perform supernatural feats.",
      "paladin": "Paladin: Holy warrior bound to a sacred oath - A holy warrior bound to a sacred oath. Paladins are champions of good and order, combining martial prowess with divine magic. They are bound by strict codes of conduct and can smite evil with divine power. Their oaths give them special abilities and define their role in the world.",
      "ranger": "Ranger: Warrior of the wilderness - A warrior of the wilderness who uses martial prowess, nature magic, and martial skill to combat threats on the edges of civilization. Rangers are skilled hunters and trackers, able to navigate difficult terrain and survive in the wild. They often have animal companions and can cast nature-based spells.",
      "rogue": "Rogue: Scoundrel who uses stealth and trickery - A scoundrel who uses stealth, trickery, and their wits to overcome obstacles. Rogues excel at finding and disarming traps, picking locks, and gathering information. In combat, they rely on precision strikes and surprise attacks, using their cunning to gain the upper hand.",
      "sorcerer": "Sorcerer: Spellcaster with innate magical ability - A spellcaster who draws on inherent magic from a gift or bloodline. Sorcerers don't study magic like wizards; instead, they are born with magical abilities. Their magic is more flexible and spontaneous than other spellcasters, and they can modify spells on the fly.",
      "warlock": "Warlock: Wielder of magic derived from bargain with extraplanar entity - A wielder of magic that is derived from a bargain with an extraplanar entity. Warlocks are defined by a pact with an otherworldly being, which grants them magical abilities. They can cast powerful spells and have unique abilities based on their patron.",
      "wizard": "Wizard: Scholarly magic-user capable of manipulating structures of reality - A scholarly magic-user capable of manipulating the structures of reality. Wizards learn their magic through years of study and research, recording their spells in spellbooks. They can cast the most powerful spells but require time to prepare them each day.",
      "races": "Races",
      "human": "Human: Versatile and ambitious - The most common race in the world, humans are known for their adaptability and ambition. They can excel in any class and often become great leaders, merchants, or adventurers. Their short lifespan drives them to achieve greatness quickly.",
      "elf": "Elf: Magical and long-lived - Graceful and magical beings who live for centuries. Elves have a deep connection to magic and nature, making them excellent wizards, rangers, and druids. They are known for their beauty, wisdom, and sometimes aloof nature.",
      "dwarf": "Dwarf: Hardy and traditional - Stout and resilient beings who excel at crafting and combat. Dwarves have a strong sense of tradition and honor, making them excellent fighters, clerics, and paladins. They are known for their craftsmanship and love of gold.",
      "halfling": "Halfling: Small and lucky - Small, cheerful beings with an uncanny knack for avoiding danger. Halflings are naturally lucky and make excellent rogues, bards, and rangers. They are known for their love of comfort, food, and adventure.",
      "dragonborn": "Dragonborn: Draconic heritage - Proud, dragon-like humanoids with a strong sense of honor and tradition. Dragonborn excel at martial combat and make excellent paladins, fighters, and sorcerers. They are known for their breath weapons and draconic ancestry.",
      "gnome": "Gnome: Small and clever - Small, curious beings with a love for knowledge and invention. Gnomes are naturally magical and make excellent wizards, sorcerers, and bards. They are known for their eccentricity and love of pranks.",
      "halfElf": "Half-Elf: Walking between worlds - Born of human and elf parents, half-elves combine the best of both races. They are charismatic and adaptable, making them excellent bards, paladins, and sorcerers. They often feel caught between two cultures.",
      "halfOrc": "Half-Orc: Savage heritage - Born of human and orc parents, half-orcs are strong and intimidating. They excel at physical combat and make excellent barbarians, fighters, and rangers. They often face prejudice due to their orc heritage.",
      "tiefling": "Tiefling: Infernal bloodline - Descendants of humans who made pacts with devils, tieflings have infernal blood. They are charismatic and magical, making them excellent sorcerers, warlocks, and bards. They often face discrimination due to their appearance.",
      "aasimar": "Aasimar: Celestial heritage - Descendants of humans blessed by celestial beings, aasimars have divine blood. They are naturally good and make excellent paladins, clerics, and monks. They often feel called to serve the forces of good.",
      "catfolk": "Catfolk: Feline grace - Graceful, cat-like humanoids with natural agility and curiosity. Catfolk excel at stealth and make excellent rogues, rangers, and monks. They are known for their independence and love of freedom.",
      "goblin": "Goblin: Small and chaotic - Small, chaotic beings with a love for fire and destruction. Goblins are naturally stealthy and make excellent rogues, sorcerers, and alchemists. They are known for their unpredictability and love of mayhem.",
      "hobgoblin": "Hobgoblin: Military discipline - Larger, more disciplined cousins of goblins with a strong military tradition. Hobgoblins excel at organized combat and make excellent fighters, clerics, and paladins. They value honor and discipline above all.",
      "orc": "Orc: Savage strength - Large, powerful beings with a reputation for violence and strength. Orcs excel at physical combat and make excellent barbarians, fighters, and rangers. They are often misunderstood and can be honorable warriors.",
      "ratfolk": "Ratfolk: Clever and adaptable - Small, intelligent beings with a natural affinity for alchemy and technology. Ratfolk excel at crafting and make excellent alchemists, wizards, and rogues. They are known for their ingenuity and adaptability.",
      "tengu": "Tengu: Crow-like cunning - Bird-like humanoids with natural agility and a love for weapons. Tengus excel at martial combat and make excellent fighters, rogues, and monks. They are known for their pride and love of collecting weapons.",
      "vanara": "Vanara: Monkey-like agility - Monkey-like humanoids with natural agility and curiosity. Vanaras excel at acrobatics and make excellent monks, rogues, and rangers. They are known for their playfulness and love of exploration."
    },
    "combat": {
      "title": "⚔️ Combat Fundamentals",
      "combatFlow": "Combat Flow",
      "initiative": "Initiative: d20 + Dexterity modifier",
      "turnActions": "Turn Actions: Move, Action, Bonus Action, Free",
      "attackRoll": "Attack Roll: d20 + ability modifier + proficiency",
      "armorClass": "Armor Class: 10 + Dex modifier + armor bonus",
      "damage": "Damage: Weapon die + ability modifier",
      "actionTypes": "Action Types",
      "action": "Action: Attack, Cast a Spell, Dash, Help, Hide, etc.",
      "bonusAction": "Bonus Action: Special abilities that use this action type",
      "reaction": "Reaction: Response to specific triggers",
      "movement": "Movement: Up to your speed per turn",
      "specialRules": "Special Combat Rules",
      "criticalHits": "Critical Hits: Natural 20 = double damage dice",
      "deathSaves": "Death Saves: Making saves when unconscious",
      "conditions": "Conditions: Blinded, charmed, frightened, etc.",
      "opportunity": "Opportunity Attacks: Free attack when enemy leaves reach"
    },
    "trivia": {
      "title": "🌟 Trivia",
      "fact1": "D&D 5e uses a 'bounded accuracy' system - bonuses increase in a controlled manner and low-level threats remain relevant even at high levels.",
      "fact2": "The inspiration mechanic was specifically designed to encourage players to roleplay their characters.",
      "fact3": "5e's design aims to combine the simplicity of old-school D&D with modern game design.",
      "fact4": "Cantrips (0-level spells) can be used unlimited times, making spellcasters more active at low levels."
    },
    "history": {
      "title": "📚 History",
      "origins": "Origins: D&D 5th Edition was published by Wizards of the Coast in 2014 and developed under the codename 'D&D Next'.",
      "design": "Design: It was designed with a 2-year public playtest process, based on community feedback.",
      "success": "Success: 5e brought RPGs into the mainstream and achieved great success thanks to popular media like Stranger Things and Critical Role.",
      "impact": "Impact: With its focus on simplicity and accessibility, it attracted a new generation of players to the RPG world."
    }
  },
  "cyberpunk": {
    "title": "🌃 CYBERPUNK RED",
    "subtitle": "Style over Substance. Attitude is Everything.",
    "coreSystem": {
      "title": "🎲 Core Mechanics",
      "diceSystem": "Dice System",
      "primary": "Primary: d10 system",
      "roll": "Roll: 1d10 + Stat + Skill vs. Target Number",
      "critSuccess": "Critical Success: Natural 10 (exploding die)",
      "critFailure": "Critical Failure: Natural 1",
      "difficulty": "Difficulty Values: 10 (Easy) to 30 (Legendary)",
      "keyConcepts": "Key Concepts",
      "style": "Style: Looking cool is as important as being effective",
      "attitude": "Attitude: Your personality defines you",
      "edge": "Edge: Living dangerously on the street",
      "cybernetics": "Cybernetics: Body modification and enhancement",
      "net": "NET: Cyberspace and hacking"
    },
    "character": {
      "title": "👤 Character Creation",
      "stats": "STATS",
      "int": "INT (Intelligence): Raw intellect",
      "ref": "REF (Reflexes): Speed and dexterity",
      "tech": "TECH (Technical): Mechanical aptitude",
      "cool": "COOL: Grace under pressure",
      "attr": "ATTR (Attractiveness): Physical appeal",
      "luck": "LUCK: How fortune favors you",
      "ma": "MA (Movement): Physical movement",
      "body": "BODY: Physical strength and constitution",
      "emp": "EMP (Empathy): Human connection ability",
      "roles": "Roles",
      "solo": "Solo: Assassin, bodyguard, killer for hire - Professional warriors who live and die by their combat skills. Solos are the most dangerous people in Night City, capable of taking on entire gangs single-handedly. They are hired guns, bodyguards, and assassins, but their violent lifestyle often leads to cyberpsychosis.",
      "netrunner": "Netrunner: Computer hacker, data thief - Digital ghosts who navigate the dangerous world of cyberspace. Netrunners are the most technologically skilled people in Night City, able to hack into any system and steal any data. They are information brokers, corporate spies, and digital terrorists, but their addiction to the net can consume them completely.",
      "tech": "Tech: Mechanic, inventor, jury-rigger - Brilliant engineers who can fix, modify, or create any piece of technology. Techs are the backbone of Night City's economy, keeping the city's infrastructure running and creating new innovations. They are mechanics, inventors, and tinkerers, but their obsession with technology can make them lose touch with humanity.",
      "medtech": "Medtech: Doctor, paramedic, street surgeon - Medical professionals who keep people alive in a world where death is cheap. Medtechs are the healers of Night City, providing medical care to everyone from corporate executives to street kids. They are doctors, paramedics, and street surgeons, but their exposure to violence and suffering can take a heavy toll.",
      "media": "Media: Reporter, investigative journalist - Truth-seekers who risk their lives to expose corruption and injustice. Media are the voice of the people in Night City, reporting on the crimes and scandals that the corporations want to keep hidden. They are reporters, investigative journalists, and documentarians, but their pursuit of truth often makes them targets.",
      "exec": "Exec: Corporate manager, deal maker - Powerful businesspeople who control the fate of millions. Execs are the rulers of Night City, making decisions that affect the lives of everyone in the city. They are corporate managers, deal makers, and power brokers, but their wealth and influence often corrupt them.",
      "lawman": "Lawman: Cop, detective, security officer - Enforcers of the law in a city where the law is often corrupt. Lawmen are the protectors of Night City, trying to maintain order in a world of chaos and violence. They are cops, detectives, and security officers, but the constant exposure to corruption and violence can break even the strongest spirit.",
      "fixer": "Fixer: Deal broker, smuggler, fence - Middlemen who make things happen in the shadows. Fixers are the grease that keeps Night City's criminal economy running, connecting buyers and sellers, arranging deals, and solving problems. They are deal brokers, smugglers, and fences, but their connections to the criminal underworld make them vulnerable.",
      "nomad": "Nomad: Road warrior, tribal wanderer - Free spirits who live on the road and answer to no one. Nomads are the outsiders of Night City, traveling from place to place in their vehicles and living by their own rules. They are road warriors, tribal wanderers, and free spirits, but their independence often makes them targets for those who want to control them."
    },
    "combat": {
      "title": "⚔️ Combat Fundamentals",
      "combatFlow": "Combat Flow",
      "initiative": "Initiative: 1d10 + REF",
      "actions": "Actions: Move and one action per turn",
      "attackRoll": "Attack Roll: 1d10 + REF + Weapon Skill vs. DV",
      "damage": "Damage: Weapon damage - armor SP",
      "location": "Location: Hit location affects damage",
      "damageHealth": "Damage & Health",
      "hitPoints": "Hit Points: 10 + (BODY × 5) + WILL",
      "wounded": "Seriously Wounded: Half HP = penalties",
      "mortally": "Mortally Wounded: 0 HP = Death Save every turn",
      "armorSP": "Armor SP: Stopping Power reduces damage",
      "critical": "Critical Injuries: Random effects from severe damage"
    },
    "trivia": {
      "title": "🌟 Trivia",
      "fact1": "Cyberpunk RED is the 'time-forward' version of the original Cyberpunk 2020, depicting the aftermath of the 4th Corporate War.",
      "fact2": "The game's 'Style over Substance' philosophy forms the basis not only of mechanics but also character creation.",
      "fact3": "The NET is now limited to local networks because the great crash (DataKrash) destroyed the old internet infrastructure.",
      "fact4": "Cyberpunk RED shares the same universe as CD Projekt RED's Cyberpunk 2077 video game."
    },
    "history": {
      "title": "📚 History",
      "origins": "Origins: Cyberpunk was created by Mike Pondsmith in 1988 and drew heavily from cyberpunk literature.",
      "evolution": "Evolution: Cyberpunk 2020 (1990) achieved great success and set the RPG standards for the genre.",
      "red": "RED Era: Cyberpunk RED, published in 2019, is the most current version of the series and takes place in 2045.",
      "influence": "Influence: The Cyberpunk series has shaped cyberpunk culture in many media from video games to film."
    }
  },
  "vampire": {
    "title": "🧛 VAMPIRE V5",
    "subtitle": "The Blood Calls, The Beast Hungers",
    "coreSystem": {
      "title": "🎲 Core Mechanics",
      "diceSystem": "Dice System",
      "dicePool": "Dice Pool: Attribute + Skill (d10s)",
      "success": "Success: 6+ on each die",
      "critical": "Critical: Pairs of 10s = 4 successes",
      "messyCrit": "Messy Critical: Critical with Hunger dice",
      "bestialFailure": "Bestial Failure: No successes with Hunger dice",
      "hunger": "The Hunger",
      "hungerDice": "Hunger Dice: Replace regular dice as you grow hungry",
      "hungerLevels": "Hunger Levels: 0-5, higher = more dangerous",
      "compulsion": "Compulsion: Overwhelming urges when hungry",
      "feeding": "Feeding: Drinking blood reduces Hunger",
      "beast": "The Beast: Your vampiric nature taking control"
    },
    "character": {
      "title": "👤 Character Creation",
      "attributes": "Attributes",
      "physical": "Physical",
      "strength": "Strength: Raw power",
      "dexterity": "Dexterity: Grace and speed",
      "stamina": "Stamina: Endurance",
      "social": "Social",
      "charisma": "Charisma: Force of personality",
      "manipulation": "Manipulation: Getting others to act",
      "composure": "Composure: Keeping cool",
      "mental": "Mental",
      "intelligence": "Intelligence: Raw intellect",
      "wits": "Wits: Cunning and perception",
      "resolve": "Resolve: Determination",
      "clans": "Clans",
      "brujah": "Brujah: The Rabble - Passionate rebels and social activists who channel their anger into political change. Brujah are known for their fiery tempers, revolutionary ideals, and fierce loyalty to their causes. They excel at inspiring others and leading movements, but their impulsiveness often gets them into trouble.",
      "gangrel": "Gangrel: The Outlanders - Beast-like survivors who have embraced their animalistic nature. Gangrel are the most feral of all vampires, able to transform into animals and communicate with them. They are solitary wanderers who prefer the wilderness to cities, and their connection to the natural world makes them excellent trackers and survivalists.",
      "malkavian": "Malkavian: The Lunatics - Insightful madmen whose mental illness grants them supernatural wisdom. Malkavians see the world differently, often speaking in riddles and prophecies that contain hidden truths. Their madness is both a curse and a gift, making them unpredictable allies and dangerous enemies.",
      "nosferatu": "Nosferatu: The Sewer Rats - Hideous information brokers who trade in secrets and knowledge. Nosferatu are permanently disfigured by the Embrace, making them unable to pass as human. They live in the shadows and underground, building vast networks of informants and spies.",
      "toreador": "Toreador: The Degenerates - Artists and hedonists who find beauty in everything they do. Toreador are the most human of all vampires, maintaining their appreciation for art, music, and culture. They are social creatures who love to be the center of attention, but their obsession with beauty can drive them to madness.",
      "tremere": "Tremere: The Warlocks - Blood sorcerers who use their magical abilities to manipulate reality. Tremere are the most organized of all clans, with a strict hierarchy and complex rituals. They are scholars and researchers, constantly seeking new magical knowledge and power.",
      "ventrue": "Ventrue: The Blue Bloods - Natural leaders and aristocrats who believe in their right to rule. Ventrue are the most politically powerful of all clans, controlling governments, corporations, and social institutions. They are refined and cultured, but their arrogance and sense of entitlement often alienate others.",
      "banuHaqim": "Banu Haqim: The Judges - Righteous warriors who believe in justice and order. Banu Haqim are the most disciplined of all vampires, following strict codes of conduct and honor. They are skilled assassins and warriors, but their rigid beliefs can make them inflexible and judgmental.",
      "hecata": "Hecata: The Necromancers - Death dealers who can communicate with and control the dead. Hecata are the most mysterious of all clans, with powers that other vampires find disturbing. They are often feared and shunned, but their abilities make them valuable allies in times of crisis.",
      "ministry": "The Ministry: The Corruptors - Tempters who use seduction and manipulation to achieve their goals. Ministry vampires are masters of social manipulation, able to turn others against each other with just a few words. They are charming and persuasive, but their methods are often cruel and destructive.",
      "ravnos": "Ravnos: The Charlatans - Illusionists who use deception and trickery to survive. Ravnos are nomadic con artists who travel from place to place, using their illusions to scam and manipulate others. They are adaptable and resourceful, but their reputation for dishonesty makes them untrustworthy allies.",
      "salubri": "Salubri: The Healers - Compassionate souls who use their powers to help others. Salubri are the rarest of all clans, nearly hunted to extinction by the Tremere. They are healers and protectors, but their pacifism and idealism often put them at odds with other vampires.",
      "tzimisce": "Tzimisce: The Fleshcrafters - Alien nobles who can reshape flesh and bone at will. Tzimisce are the most alien of all vampires, with powers that defy natural law. They are scholars and artists, but their experiments on living beings make them feared and reviled by other Kindred."
    },
    "combat": {
      "title": "⚔️ Combat & Conflict",
      "combatFlow": "Combat Flow",
      "initiative": "Initiative: Wits + Dexterity",
      "declare": "Declare Actions: State what you're doing",
      "roll": "Roll Dice: Attribute + Skill pool",
      "damage": "Apply Damage: Successes = damage",
      "frenzy": "Check for Frenzy: Beast may take control",
      "damageTypes": "Damage Types",
      "superficial": "Superficial: Heals quickly, halved damage",
      "aggravated": "Aggravated: Fire, sunlight, supernatural - hard to heal",
      "willpower": "Willpower: Mental/social damage",
      "staking": "Staking: Paralyzes but doesn't destroy",
      "frenzyTypes": "Frenzy",
      "fury": "Fury Frenzy: Berserk rage, attack everything",
      "terror": "Terror Frenzy: Overwhelming fear, flee at any cost",
      "hunger": "Hunger Frenzy: Must feed immediately",
      "compulsion": "Compulsion: Lesser urges that drive behavior"
    },
    "trivia": {
      "title": "🌟 Trivia",
      "fact1": "The Hunger system in V5 is a revolutionary innovation that integrates the vampire's bestial nature into the game's mechanics.",
      "fact2": "The concept of Messy Critical simulates how powerful successes can lead to unexpected consequences.",
      "fact3": "V5 has made the traditional Humanity system more personal with Convictions and Touchstones.",
      "fact4": "The Second Inquisition is the biggest threat in the game, vampire hunters using modern technology."
    },
    "history": {
      "title": "📚 History",
      "origins": "Origins: Vampire: The Masquerade was created by White Wolf Game Studio in 1991 and laid the foundation for the World of Darkness.",
      "editions": "Editions: The game went through many editions; V5 (2018) was one of the most radical revisions.",
      "influence": "Influence: Vampire changed the RPG industry with its gothic-punk aesthetic and personal horror themes.",
      "modern": "Modern Nights: V5 reflects the challenges vampires face in the modern world and the effects of technology."
    }
  },
  "system": {
    "deathwatch": {
      "setting": "In the grim darkness of the far future, there is only war"
    },
    "pathfinder": {
      "setting": "A world of magic, monsters, and heroic deeds"
    },
    "dnd5e": {
      "setting": "Dungeons, dragons, and legendary heroes"
    },
    "cyberpunk-red": {
      "setting": "Style over substance in the dark future of 2045"
    },
    "vampire-v5": {
      "setting": "The eternal struggle between the Beast and humanity"
    }
  },
  "lore": {
    "deathwatch": {
      "title": "📖 World Lore",
      "grimDarkness": "The Grim Darkness of the 41st Millennium",
      "grimDarknessText": "In the vast, uncaring void of the 41st millennium, humanity stands alone against the darkness. Ten thousand years of war, betrayal, and cosmic horror have forged an empire of a million worlds, yet even this vast dominion is but a flickering candle against the endless night. The Imperium of Man, ruled by the God-Emperor enthroned in deathless agony upon the Golden Throne, faces threats from every quarter—heretical cults, ravenous Tyranid hive fleets, the ancient and malevolent Necrons, and the capricious forces of Chaos itself.",
      "sacredDuty": "The Sacred Duty of the Deathwatch",
      "sacredDutyText": "When a Space Marine is selected for the Deathwatch, he leaves behind his Chapter's colors and traditions, donning the black armor of the Long Watch. This is no temporary assignment—it is a sacred calling that may last decades or even centuries. Each Deathwatch Space Marine carries the weight of humanity's survival upon his shoulders, for they alone possess the knowledge, training, and unbreakable will to face the galaxy's most dangerous xenos threats.",
      "killTeams": "Kill-teams: The Emperor's Finest",
      "killTeamsText": "Each Kill-team is a carefully crafted instrument of death, composed of Space Marines from different Chapters, each bringing their unique skills and traditions to the mission. A Kill-team might include a Blood Angel's berserker fury, a Space Wolf's savage cunning, an Ultramarine's tactical brilliance, and a Dark Angel's mysterious determination. This diversity is their strength, allowing them to adapt to any threat and overcome any obstacle.",
      "alienThreat": "The Alien Threat",
      "alienThreatText": "The galaxy teems with hostile alien species, each more dangerous than the last. The Tyranids, a ravenous swarm of bio-engineered horrors, consume entire worlds in their endless hunger. The Necrons, ancient machines of living metal, seek to reclaim their lost empire and purge all organic life from the galaxy. The Tau, with their advanced technology and insidious ideology, spread their influence through diplomacy and conquest.",
      "priceVigilance": "The Price of Vigilance",
      "priceVigilanceText": "The Deathwatch pays a terrible price for their vigilance. Every mission is a suicide run, every engagement potentially their last. They face horrors that would drive lesser men mad, fight battles that would break the spirit of ordinary warriors. Many never return from their missions, their names added to the long list of heroes who gave their lives in service to the Emperor."
    },
    "pathfinder": {
      "title": "📖 World Lore",
      "golarion": "The World of Golarion: A Land of Ancient Mysteries",
      "golarionText": "Welcome to Golarion, a world where the divine walks among mortals and ancient empires lie buried beneath the sands of time. This is a realm where magic flows as freely as the rivers, where gods answer prayers with miracles and curses, and where every crumbling ruin holds the promise of untold treasures and terrible dangers. Golarion is not merely a setting—it is a living, breathing world where your actions can reshape the course of history.",
      "pantheon": "The Pantheon: Gods of Light and Shadow",
      "pantheonText": "Golarion's pantheon is as diverse as the world itself, with deities representing every aspect of mortal existence. Abadar, the Master of the First Vault, watches over civilization, commerce, and law, while Calistria, the Savored Sting, embodies revenge, lust, and trickery. Iomedae, the Inheritor, carries the torch of Aroden's legacy as the goddess of justice and valor, while Pharasma, the Lady of Graves, judges the souls of the dead.",
      "ancientCivilizations": "Ancient Civilizations and Lost Secrets",
      "ancientCivilizationsText": "Golarion's history stretches back millennia, with countless civilizations rising and falling like the tides. The Azlanti Empire, humanity's first great civilization, achieved heights of magic and technology that modern scholars can barely comprehend. Their fall came during Earthfall, when a massive asteroid struck the world, creating the Inner Sea and plunging the world into darkness.",
      "magic": "Magic: The Lifeblood of Golarion",
      "magicText": "Magic in Golarion is not merely a tool—it is a fundamental force that shapes reality itself. Arcane magic draws power from the stars and the elements, while divine magic flows from the gods and their domains. Primal magic connects mortals to the natural world, and psychic magic taps into the power of the mind and soul.",
      "politicalTensions": "Current Tensions and Political Intrigue",
      "politicalTensionsText": "Golarion is a world in flux, with old powers fading and new ones rising to take their place. The nation of Cheliax, once the greatest human empire, now serves as a vassal to the archdevil Asmodeus, its people living under the rule of diabolical nobility. The city-state of Absalom, built around the Starstone, serves as a neutral ground where representatives of every nation and faith gather to trade, negotiate, and scheme."
    },
    "dnd5e": {
      "title": "📖 World Lore",
      "magicWonder": "A World of Magic and Wonder",
      "magicWonderText": "Welcome to a realm where the impossible becomes reality, where dragons soar through storm-wracked skies, and where ancient magic flows through every stone and stream. This is a world of high fantasy, where heroes are born from humble beginnings and legends are written in the blood of those brave enough to face the darkness. In this land of wonder and peril, every choice you make shapes the destiny of nations and the fate of worlds.",
      "realmsAdventure": "The Realms of Adventure",
      "realmsAdventureText": "This world is vast and varied, with realms as diverse as the creatures that inhabit them. Majestic kingdoms rise from fertile plains, their spires reaching toward the heavens, while ancient forests hide secrets older than memory. Deserts stretch across the horizon, their shifting sands concealing lost cities and forgotten tombs. Mountains pierce the clouds, their peaks home to dragons and giants, while beneath the earth lie vast networks of caverns and dungeons, each holding treasures and terrors beyond imagining.",
      "perilousWilds": "The Perilous Wilds",
      "perilousWildsText": "Beyond the safety of city walls lies a world of danger and opportunity. The wilderness is home to creatures both beautiful and terrible—graceful unicorns that heal the wounded, fierce griffons that hunt from the skies, and cunning goblins that raid from their mountain strongholds. Orcs gather in warbands, threatening civilized lands with their savage raids, while trolls lurk in swamps and marshes, their regenerative powers making them nearly impossible to kill.",
      "kingdomsPeril": "Kingdoms in Peril",
      "kingdomsPerilText": "The political landscape of this world is as complex as it is dangerous. Noble houses vie for power and influence, their rivalries sometimes erupting into open warfare. Kings and queens rule with varying degrees of wisdom and compassion, while councils of elders and assemblies of the people govern in other lands. But all rulers face the same challenges—threats from within and without, the constant struggle to maintain order in a world where chaos always lurks just beyond the horizon.",
      "ancientLegends": "Ancient Legends and Forgotten Lore",
      "ancientLegendsText": "The history of this world stretches back to the dawn of time itself, with each age leaving its mark on the present. Ancient empires rose and fell, their ruins now scattered across the landscape like broken dreams. Legendary heroes performed deeds of valor and sacrifice, their names still spoken with reverence and awe. And dark forces were sealed away in forgotten tombs and lost dungeons, their power contained but never truly destroyed."
    },
    "cyberpunk": {
      "title": "📖 World Lore",
      "fourthWar": "The World After the Fourth Corporate War",
      "fourthWarText": "Welcome to Night City, a neon-lit hellscape where the American Dream died and was reborn as a corporate nightmare. The year is 2045, and the world is still reeling from the Fourth Corporate War—a conflict that didn't just change the geopolitical landscape; it shattered it completely. Governments collapsed, corporations became the new superpowers, and the line between human and machine blurred beyond recognition. This is the Time of the Red, an era of chaos, opportunity, and survival.",
      "nightCity": "Night City: The City of Dreams and Nightmares",
      "nightCityText": "Night City stands as a monument to human ambition and folly, a sprawling metropolis where skyscrapers pierce the smog-choked sky and the streets pulse with the rhythm of a million lives lived on the edge. This is a city of contrasts—where corporate executives live in luxury penthouses while street kids fight for survival in the Combat Zone, where cutting-edge technology exists alongside medieval levels of poverty and violence.",
      "corporateOrder": "The New Corporate Order",
      "corporateOrderText": "The corporations emerged from the Fourth Corporate War as the world's true powers. Arasaka, Militech, Biotechnica, and the other megacorps don't just control markets—they control governments, armies, and the very fabric of society. These corporations are more than businesses; they are nations unto themselves, with their own laws, their own armies, and their own agendas.",
      "netrunners": "Netrunners: Digital Ghosts in the Machine",
      "netrunnersText": "The new net is a dangerous place, a digital frontier where data is currency and information is power. Netrunners are the digital cowboys of this new frontier, using their cyberdecks to navigate the complex web of corporate networks, government systems, and underground data fortresses. They are hackers, spies, and thieves, operating in a world where the line between the real and the virtual has all but disappeared.",
      "edgeRunners": "Edge Runners: Living on the Edge",
      "edgeRunnersText": "Edge runners are the heroes and villains of Night City, men and women who live by their wits, their skills, and their willingness to do whatever it takes to survive. They are mercenaries, fixers, and criminals, operating in the shadows where the law doesn't reach and the corporations don't care. They are the ones who get things done, whether those things are legal, illegal, or somewhere in between.",
      "technologyHumanity": "Technology and Humanity",
      "technologyHumanityText": "Technology has transformed what it means to be human in Night City. Cybernetic implants are as common as tattoos, with people replacing their natural parts with artificial ones for function, fashion, or both. Neural interfaces allow direct connection to the net, while cyberdecks turn the human brain into a computer terminal. But this technology comes with a price—cyberpsychosis, the mental breakdown that can occur when too much of the human mind is replaced by machine."
    },
    "vampire": {
      "title": "📖 World Lore",
      "hiddenWorld": "The Hidden World of the Damned",
      "hiddenWorldText": "Welcome to the World of Darkness, where the night belongs to creatures that were once human but are now something else entirely. This is a world where vampires walk among us, hidden in plain sight, their existence protected by the most sacred law of their kind: the Masquerade. They are the children of Caine, cursed with immortality and damned to walk the earth forever, feeding on the blood of the living while struggling to maintain their humanity in a world that has moved on without them.",
      "camarilla": "The Camarilla: Keepers of the Old Ways",
      "camarillaText": "The Camarilla is the oldest and most powerful organization of vampires in the world, a secret society that has maintained the Masquerade and kept the Kindred hidden from mortal eyes for centuries. They are the establishment, the ruling class of the undead world, with their own laws, their own hierarchy, and their own traditions. The Camarilla believes in order, discipline, and the preservation of the old ways, even as the modern world threatens to overwhelm them.",
      "anarchMovement": "The Anarch Movement: Rebels and Revolutionaries",
      "anarchMovementText": "The Anarch Movement represents everything the Camarilla is not—chaos, freedom, and the rejection of the old order. Anarchs believe that the Camarilla's rigid hierarchy and ancient traditions are holding the Kindred back, preventing them from adapting to the modern world. They see the Second Inquisition as proof that the old ways have failed, and they believe that only by embracing change can the Kindred survive.",
      "masquerade": "The Masquerade: The Sacred Law",
      "masqueradeText": "The Masquerade is the most important law in the world of the Kindred, the rule that keeps their existence hidden from mortal eyes. It is simple in concept but complex in execution: vampires must never reveal their true nature to mortals, and any breach of this law is punishable by death. The Masquerade is not just a law—it is a way of life, a constant performance that every vampire must maintain, day after day, year after year, century after century.",
      "beastWithin": "The Beast Within: Humanity and Monstrosity",
      "beastWithinText": "Every vampire struggles with the Beast, the primal, predatory nature that lurks within their undead soul. The Beast is hunger, rage, and the desire to dominate and destroy. It is what makes vampires monsters, and it is what they must constantly fight against if they want to maintain their humanity. But the Beast is also what gives them their power, their strength, and their immortality. It is a curse and a blessing, a source of both horror and wonder."
    }
  }
}
